IDENTIFICATION DIVISION.
PROGRAM-ID. CONSTANTS.
ENVIRONMENT DIVISION.
DATA DIVISION.
PROCEDURE DIVISION.

PROGRAM-BEGIN.
	DISPLAY "hello world".
	DISPLAY 55.
	DISPLAY 12.607.
PROGRAM-DONE.
	STOP RUN.
