IDENTIFICATION DIVISION.
PROGRAM-ID. FILE1.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
	SELECT PHONE-FILE
		ASSIGN TO 'phone.dat'
		ORGANIZATION IS SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD PHONE-FILE
	LABEL RECORDS ARE STANDARD.
01 PHONE-RECORD.
	05 PHONE-NO	PIC X(6).
	05 PHONE-NAME	PIC X(10).

WORKING-STORAGE SECTION.

01 YES-NO	PIC X.
01 ENTRY-OK	PIC X.

PROCEDURE DIVISION.

PROGRAM-BEGIN.
	OPEN INPUT PHONE-FILE.
	READ PHONE-FILE.
	DISPLAY PHONE-RECORD.
	
PROGRAM-DONE.
	STOP RUN.
