IDENTIFICATION DIVISION.
PROGRAM-ID. FILE2.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
	SELECT PHONE-FILE
		ASSIGN TO 'phone.dat'
		ORGANIZATION IS SEQUENTIAL.
DATA DIVISION.
FILE SECTION.
FD PHONE-FILE
	LABEL RECORDS ARE STANDARD.
01 PHONE-RECORD.
	05 PHONE-NO	PIC X(6).
	05 PHONE-NAME	PIC X(10).

WORKING-STORAGE SECTION.

01 EOF PIC X(1) VALUE IS 'N'.

PROCEDURE DIVISION.

PROGRAM-BEGIN.
	PERFORM UNTIL EOF EQUAL TO 'Y' 
	OPEN INPUT PHONE-FILE
	READ PHONE-FILE
	DISPLAY PHONE-NO
	END-PERFORM.

PROGRAM-DONE.
	STOP RUN.
