IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO04.

ENVIRONMENT DIVISION.
DATA DIVISION.
PROCEDURE DIVISION.

PROGRAM-BEGIN.
	DISPLAY "TODAY'S MESSAGE IS: ".
	PERFORM SAY-HELLO.
	PERFORM SAY-MC.
PROGRAM-DONE.
	STOP RUN.
SAY-HELLO.
	DISPLAY "HELLO WORLD".
SAY-MC.
	DISPLAY "MADAR CHOD".
