IDENTIFICATION DIVISION.
PROGRAM-ID. IFELSE.

ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.

01 YES-OR-NO PIC X.

PROCEDURE DIVISION.
PROGRAM-BEGIN.
	PERFORM GET-THE-ANSWER.
	PERFORM DISPLAY-THE-ANSWER.
PROGRAM-DONE.
	STOP RUN.

GET-THE-ANSWER.
	DISPLAY "IS THE ANSWER YES OR NO".
	ACCEPT YES-OR-NO.

DISPLAY-THE-ANSWER.
	IF YES-OR-NO = "Y"
		DISPLAY "You answered yes.".
	IF YES-OR-NO = "N"
		DISPLAY "You answered no.".

