IDENTIFICATION DIVISION.
PROGRAM-ID. JACK06.
ENVIRONMENT DIVISION.
DATA DIVISION.

WORKING-STORAGE SECTION.

01 THE-WHOLE-MESSAGE.
	05 THE-NUMBER	PIC 9(2) VALUE 1.
	05 A-SPACE 	PIC X(2) VALUE SPACE.
	05 THE-MESSAGE.
		10 JACKS-NAME	PIC X(5) VALUE "JACK".
		10 JACKS-TASK	PIC X(45).

PROCEDURE DIVISION.
PROGRAM-BEGIN.

	MOVE "BE NIMBLE," TO JACKS-TASK.
	DISPLAY THE-WHOLE-MESSAGE.

	MOVE "BE QUICK," TO JACKS-TASK.
	ADD 1 TO THE-NUMBER.
	DISPLAY THE-WHOLE-MESSAGE.

	MOVE "JUMP OVER THE CANDLESTICK." TO JACKS-TASK.
	ADD 1 TO THE-NUMBER.
	DISPLAY THE-WHOLE-MESSAGE.

	MOVE "THAT'S ALL FOLKS" TO THE-WHOLE-MESSAGE.
	DISPLAY THE-WHOLE-MESSAGE.

PROGRAM-DONE.
	STOP RUN.

