IDENTIFICATION DIVISION.
PROGRAM-ID. MENU01.

ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.

01 MENU-PICK PIC 9.

PROCEDURE DIVISION.
PROGRAM-BEGIN.
	
	PERFORM GET-THE-MENU-PICK.

	PERFORM DO-THE-MENU-PICK.

PROGRAM-DONE.
	STOP RUN.

GET-THE-MENU-PICK.
	
	PERFORM DISPLAY-THE-MENU.
	PERFORM GET-THE-PICK.

DO-THE-MENU-PICK.
	IF MENU-PICK < 1 OR MENU-PICK > 3
		DISPLAY "INVALID SELECTION".
	
	IF MENU-PICK = 1
	DISPLAY "SUCK MY DICK".
	
	IF MENU-PICK = 2
	DISPLAY "KISS MY ASS".

	IF MENU-PICK = 3
	DISPLAY "FUCK OFF ".

DISPLAY-THE-MENU.
	DISPLAY "ENTER THE OPTION:"
	DISPLAY "1. FIRST".
	DISPLAY "2. SECOND".
	DISPLAY "3. THIRD".
	DISPLAY " UR OPTION ?".

GET-THE-PICK.
	ACCEPT MENU-PICK.
	

