IDENTIFICATION DIVISION.
PROGRAM-ID. MENU.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.

01 MENU-PICK PIC 9.
	88 PICK-IS-EXIT  VALUE  0.

PROCEDURE DIVISION.

PROGRAM-BEGIN.

	MOVE 1 TO MENU-PICK.
	PERFORM GET-AND-DO-PICK
	UNTIL PICK-IS-EXIT.

	DISPLAY "THANK U. EXITING.".

PROGRAM-DONE.
	STOP RUN.

GET-AND-DO-PICK.
	PERFORM GET-THE-MENU-PICK.

	PERFORM DO-THE-MENU-PICK.

GET-THE-MENU-PICK.
	PERFORM DISPLAY-THE-MENU.
	PERFORM GET-THE-PICK.

DO-THE-MENU-PICK.
	IF MENU-PICK > 3
		DISPLAY "INVALID SELECTION.".
	
	IF MENU-PICK = 1
		DISPLAY "ONE FOR THE MONEY.".

	IF MENU-PICK = 2
		DISPLAY "TWO FOR THE SHOW.".

	IF MENU-PICK = 3
		DISPLAY "THREE TO GET READY.".

DISPLAY-THE-MENU.

	DISPLAY "ENTER THE NUMBER".
	DISPLAY "THAT U WISH.".
	DISPLAY " ".
	DISPLAY "1. FIRST MESSAGE".
	DISPLAY "2. SECOND MESSAGE".
	DISPLAY "3. THIRD MESSAGE".
	DISPLAY " ".
	DISPLAY "0. EXIT".
	DISPLAY " ".
	DISPLAY "UR SELECTION".

GET-THE-PICK.
	ACCEPT MENU-PICK.

