IDENTIFICATION DIVISION.
PROGRAM-ID. SAND02.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.

01 MENU-PICK	PIC 99.
	88 PICK-IS-EXIT	VALUES 0, 11 THROUGH 20.

PROCEDURE DIVISION.
PROGRAM-BEGIN.
	
	MOVE 1 TO MENU-PICK.
	PERFORM GET-AND-DO-PICK
		UNTIL PICK-IS-EXIT..

	DISPLAY "THANK U. EXITING".
PROGRAM-DONE.
	STOP RUN.

GET-AND-DO-PICK.
	PERFORM GET-THE-MENU-PICK.
	PERFORM DO-THE-MENU-PICK.

GET-THE-MENU-PICK.
	PERFORM DISPLAY-THE-MENU.
	PERFORM GET-THE-PICK.

DO-THE-MENU-PICK.
	IF MENU-PICK > 3
		DISPLAY "INVALID SELECTION".
	
	IF MENU-PICK = 1
		DISPLAY "ONE".
	
	IF MENU-PICK = 2
		DISPLAY "TWO".
	
	IF MENU-PICK = 3
		DISPLAY "THREE".

DISPLAY-THE-MENU.
	DISPLAY "ENTER THE NUM:".
	DISPLAY "1. 1ST MESSAGE".
	DISPLAY "2. 2ND MESSAGE".
	DISPLAY "3. 3RD MESSAGE".
	DISPLAY "0. EXIT".

GET-THE-PICK.
	ACCEPT MENU-PICK.

