IDENTIFICATION DIVISION.
PROGRAM-ID. STRING1.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-DATA-ITEM1	PIC X(20) VALUE 'THIS STATEMENT'.
   
01 WS-DATA-ITEM2 	PIC X(20) VALUE 'IS EXAMPLE #2 AND'.
01 WS-DATA-ITEM3	PIC X(25) VALUE "FOR STRING CONCATENATION".
01 WS-POINTER 		PIC 9(02) VALUE 1.
01 WS-DESTINATION	PIC X(50).
PROCEDURE DIVISION.

		STRING	

		WS-DATA-ITEM1 DELIMITED BY SPACES
		SPACE 	DELIMITED BY SIZE
		WS-DATA-ITEM2 DELIMITED BY '#2'
		SPACE  DELIMITED BY SIZE	
        	WS-DATA-ITEM3  DELIMITED BY SIZE
		INTO WS-DESTINATION
		WITH POINTER WS-POINTER
		ON OVERFLOW
			DISPLAY "OVERFLOW CONDITION OCCURRED".




	DISPLAY WS-DESTINATION.
	STOP RUN.

